# ReferencePointArray Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePointArray Constructor
ReferencePointArray Class See Also
---
Initializes a new instance of the ReferencePointArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ReferencePointArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ReferencePointArray()
```

# See Also
ReferencePointArray Class
Autodesk.Revit.DB Namespace